In [2]:
import pandas as pd
import numpy as np

In [3]:
arrays = [

    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],

    ["one", "two", "one", "two", "one", "two", "one", "two"],

]



tuples = list(zip(*arrays))

tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [4]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [5]:
s = pd.Series(np.random.randn(8), index=index)

s

first  second
bar    one      -1.194050
       two      -0.524203
baz    one       0.635871
       two      -0.268402
foo    one      -1.976209
       two       0.060937
qux    one       0.083740
       two      -1.897281
dtype: float64

In [6]:
iterables = [["bar", "baz", "foo", "qux"], ["one", "two"]]

pd.MultiIndex.from_product(iterables, names=["first", "second"])

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [7]:
df = pd.DataFrame(

    [["bar", "one"], ["bar", "two"], ["foo", "one"], ["foo", "two"]],

    columns=["first", "second"],

)



pd.MultiIndex.from_frame(df)

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['first', 'second'])

In [8]:
arrays = [

    np.array(["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"]),

    np.array(["one", "two", "one", "two", "one", "two", "one", "two"]),

]



s = pd.Series(np.random.randn(8), index=arrays)

s

bar  one    0.441559
     two    0.228312
baz  one   -1.366432
     two   -2.615238
foo  one   -0.227098
     two    0.173800
qux  one    1.470444
     two   -1.095329
dtype: float64

In [9]:
df.index.names

FrozenList([None])

In [10]:
df = pd.DataFrame(np.random.randn(3, 8), index=["A", "B", "C"], columns=index)

df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [11]:
pd.DataFrame(np.random.randn(6, 6), index=index[:6], columns=index[:6])

first              bar                 baz                 foo
second             one       two       one       two       one       two
first second
bar   one    -1.465341 -1.663116 -1.449146 -1.982969  0.360329 -1.423539
      two    -1.151351 -0.704613  0.270083  0.260593 -0.944900 -0.330197
baz   one    -1.243168 -1.026756 -0.491466  0.830058  1.417244 -0.186617
      two    -1.913877  0.420914 -0.310198 -1.233994 -0.656032 -1.610313
foo   one    -0.487209 -0.504100  0.200819 -0.246953  0.884164  0.754537
      two    -1.743265  0.235184  0.078153 -0.596818 -0.152054 -0.781528

In [13]:
with pd.option_context("display.multi_sparse", False):

    print(df)

first        bar       bar       baz       baz       foo       foo       qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first        qux
second       two
A       0.716804
B       0.187324
C      -1.466834

In [17]:
tmp = pd.Series(np.random.randn(8), index=tuples)
tmp

(bar, one)   -1.469955
(bar, two)   -1.215525
(baz, one)    1.641316
(baz, two)   -0.887380
(foo, one)    0.056543
(foo, two)    0.190405
(qux, one)   -0.611238
(qux, two)   -0.334157
dtype: float64

In [18]:
tmp[('bar', 'one')]

-1.4699552813290193

In [20]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [19]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [21]:
index.get_level_values("second")

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

In [22]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [23]:
df["bar"]

second       one       two
A      -1.099968  0.775524
B      -0.905454  0.047056
C       2.980732  0.567498

In [24]:
df["bar", "one"]

A   -1.099968
B   -0.905454
C    2.980732
Name: (bar, one), dtype: float64

In [25]:
df["bar"]["one"]

A   -1.099968
B   -0.905454
C    2.980732
Name: one, dtype: float64

In [26]:
s["qux"]

one    1.470444
two   -1.095329
dtype: float64

In [27]:
df.columns.levels  # original MultiIndex

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [31]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [30]:
df[["foo","qux"]]

first        foo                 qux
second       one       two       one       two
A       0.904136  0.079566 -0.192781  0.716804
B       0.177659  2.283450 -0.344664  0.187324
C       0.969994 -0.353649  0.127216 -1.466834

In [28]:
df[["foo","qux"]].columns.levels  # sliced

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [29]:
df[["foo", "qux"]].columns.to_numpy()

array([('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')],
      dtype=object)

In [32]:
# for a specific level

df[["foo", "qux"]].columns.get_level_values(0)

Index(['foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [33]:
new_mi = df[["foo", "qux"]].columns.remove_unused_levels()

new_mi.levels

FrozenList([['foo', 'qux'], ['one', 'two']])

In [34]:
new_mi

MultiIndex([('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [35]:
s

bar  one    0.441559
     two    0.228312
baz  one   -1.366432
     two   -2.615238
foo  one   -0.227098
     two    0.173800
qux  one    1.470444
     two   -1.095329
dtype: float64

In [36]:
s[:-2]

bar  one    0.441559
     two    0.228312
baz  one   -1.366432
     two   -2.615238
foo  one   -0.227098
     two    0.173800
dtype: float64

In [37]:
s + s[:-2]

bar  one    0.883119
     two    0.456625
baz  one   -2.732864
     two   -5.230476
foo  one   -0.454195
     two    0.347599
qux  one         NaN
     two         NaN
dtype: float64

In [38]:
s + s[::2]

bar  one    0.883119
     two         NaN
baz  one   -2.732864
     two         NaN
foo  one   -0.454195
     two         NaN
qux  one    2.940887
     two         NaN
dtype: float64

In [41]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [42]:
tmp = s.reindex(index[:3])
tmp

first  second
bar    one       0.441559
       two       0.228312
baz    one      -1.366432
dtype: float64

In [43]:
s.reindex([("foo", "two"), ("bar", "one"), ("qux", "one"), ("baz", "one")])

foo  two    0.173800
bar  one    0.441559
qux  one    1.470444
baz  one   -1.366432
dtype: float64

In [44]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [45]:
df = df.T

df

                     A         B         C
first second
bar   one    -1.099968 -0.905454  2.980732
      two     0.775524  0.047056  0.567498
baz   one    -0.280117  0.474000  0.593460
      two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649
qux   one    -0.192781 -0.344664  0.127216
      two     0.716804  0.187324 -1.466834

In [46]:
df.loc[("bar", "two")]

A    0.775524
B    0.047056
C    0.567498
Name: (bar, two), dtype: float64

In [47]:
df.loc[("bar", "two"), "A"]

0.7755244705701126

In [48]:
df.loc["bar"]

               A         B         C
second
one    -1.099968 -0.905454  2.980732
two     0.775524  0.047056  0.567498

In [49]:
df.loc["baz":"foo"]

                     A         B         C
first second
baz   one    -0.280117  0.474000  0.593460
      two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649

In [50]:
df.loc[("baz", "two"):("qux", "one")]

                     A         B         C
first second
baz   two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649
qux   one    -0.192781 -0.344664  0.127216

In [51]:
df.loc[("baz", "two"):"foo"]

                     A         B         C
first second
baz   two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649

In [52]:
df.loc[[("bar", "two"), ("qux", "one")]]

                     A         B         C
first second
bar   two     0.775524  0.047056  0.567498
qux   one    -0.192781 -0.344664  0.127216

In [53]:
s = pd.Series(

    [1, 2, 3, 4, 5, 6],

    index=pd.MultiIndex.from_product([["A", "B"], ["c", "d", "e"]]),

)

s

A  c    1
   d    2
   e    3
B  c    4
   d    5
   e    6
dtype: int64

In [54]:
s.loc[[("A", "c"), ("B", "d")]]  # list of tuples

A  c    1
B  d    5
dtype: int64

In [55]:
s.loc[(["A", "B"], ["c", "d"])]  # tuple of lists

A  c    1
   d    2
B  c    4
   d    5
dtype: int64

In [56]:
def mklbl(prefix, n):

    return ["%s%s" % (prefix, i) for i in range(n)]



miindex = pd.MultiIndex.from_product(

    [mklbl("A", 4), mklbl("B", 2), mklbl("C", 4), mklbl("D", 2)]

)



micolumns = pd.MultiIndex.from_tuples(

    [("a", "foo"), ("a", "bar"), ("b", "foo"), ("b", "bah")], names=["lvl0", "lvl1"]

)



dfmi = (

    pd.DataFrame(

        np.arange(len(miindex) * len(micolumns)).reshape(

            (len(miindex), len(micolumns))

        ),

        index=miindex,

        columns=micolumns,

    )

    .sort_index()

    .sort_index(axis=1)

)



dfmi

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C0 D0    1    0    3    2
         D1    5    4    7    6
      C1 D0    9    8   11   10
         D1   13   12   15   14
      C2 D0   17   16   19   18
...          ...  ...  ...  ...
A3 B1 C1 D1  237  236  239  238
      C2 D0  241  240  243  242
         D1  245  244  247  246
      C3 D0  249  248  251  250
         D1  253  252  255  254

[64 rows x 4 columns]

In [57]:
dfmi.loc[(slice("A1", "A3"), slice(None), ["C1", "C3"]), :]

lvl0           a         b
lvl1         bar  foo  bah  foo
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
      C3 D0   89   88   91   90
         D1   93   92   95   94
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
      C3 D0  121  120  123  122
         D1  125  124  127  126
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
      C3 D0  153  152  155  154
         D1  157  156  159  158
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174
      C3 D0  185  184  187  186
         D1  189  188  191  190
A3 B0 C1 D0  201  200  203  202
         D1  205  204  207  206
      C3 D0  217  216  219  218
         D1  221  220  223  222
   B1 C1 D0  233  232  235  234
         D1  237  236  239  238
      C3 D0  249  248  251  250
         D1  253  252  255  254

In [59]:
idx = pd.IndexSlice

# This will give the same result as:
# dfmi.loc[(slice("A1", "A3"), slice(None), ["C1", "C3"]), :]

dfmi.loc[idx["A1":"A3", :, ["C1", "C3"]], :]

lvl0           a         b
lvl1         bar  foo  bah  foo
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
      C3 D0   89   88   91   90
         D1   93   92   95   94
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
      C3 D0  121  120  123  122
         D1  125  124  127  126
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
      C3 D0  153  152  155  154
         D1  157  156  159  158
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174
      C3 D0  185  184  187  186
         D1  189  188  191  190
A3 B0 C1 D0  201  200  203  202
         D1  205  204  207  206
      C3 D0  217  216  219  218
         D1  221  220  223  222
   B1 C1 D0  233  232  235  234
         D1  237  236  239  238
      C3 D0  249  248  251  250
         D1  253  252  255  254

In [58]:
idx = pd.IndexSlice

dfmi.loc[idx[:, :, ["C1", "C3"]], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A0 B0 C1 D0    8   10
         D1   12   14
      C3 D0   24   26
         D1   28   30
   B1 C1 D0   40   42
         D1   44   46
      C3 D0   56   58
         D1   60   62
A1 B0 C1 D0   72   74
         D1   76   78
      C3 D0   88   90
         D1   92   94
   B1 C1 D0  104  106
         D1  108  110
      C3 D0  120  122
         D1  124  126
A2 B0 C1 D0  136  138
         D1  140  142
      C3 D0  152  154
         D1  156  158
   B1 C1 D0  168  170
         D1  172  174
      C3 D0  184  186
         D1  188  190
A3 B0 C1 D0  200  202
         D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [60]:
dfmi.loc["A1", (slice(None), "foo")]

lvl0        a    b
lvl1      foo  foo
B0 C0 D0   64   66
      D1   68   70
   C1 D0   72   74
      D1   76   78
   C2 D0   80   82
      D1   84   86
   C3 D0   88   90
      D1   92   94
B1 C0 D0   96   98
      D1  100  102
   C1 D0  104  106
      D1  108  110
   C2 D0  112  114
      D1  116  118
   C3 D0  120  122
      D1  124  126

In [64]:
idx = pd.IndexSlice

# Becomes this:
#dfmi.loc[idx["A1"], idx[:, "foo"]]

# Or even more simply:
dfmi.loc["A1", idx[:, "foo"]]

lvl0        a    b
lvl1      foo  foo
B0 C0 D0   64   66
      D1   68   70
   C1 D0   72   74
      D1   76   78
   C2 D0   80   82
      D1   84   86
   C3 D0   88   90
      D1   92   94
B1 C0 D0   96   98
      D1  100  102
   C1 D0  104  106
      D1  108  110
   C2 D0  112  114
      D1  116  118
   C3 D0  120  122
      D1  124  126

In [65]:
dfmi.loc[idx[:, :, ["C1", "C3"]], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A0 B0 C1 D0    8   10
         D1   12   14
      C3 D0   24   26
         D1   28   30
   B1 C1 D0   40   42
         D1   44   46
      C3 D0   56   58
         D1   60   62
A1 B0 C1 D0   72   74
         D1   76   78
      C3 D0   88   90
         D1   92   94
   B1 C1 D0  104  106
         D1  108  110
      C3 D0  120  122
         D1  124  126
A2 B0 C1 D0  136  138
         D1  140  142
      C3 D0  152  154
         D1  156  158
   B1 C1 D0  168  170
         D1  172  174
      C3 D0  184  186
         D1  188  190
A3 B0 C1 D0  200  202
         D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [67]:
mask = dfmi[("a", "foo")] > 200

mask.shape

(64,)

In [77]:
dfmi.columns

MultiIndex([('a', 'bar'),
            ('a', 'foo'),
            ('b', 'bah'),
            ('b', 'foo')],
           names=['lvl0', 'lvl1'])

In [84]:
dfmi.loc[idx[mask, :, ["C1", "C3"], :], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A3 B0 C1 D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [85]:
dfmi.loc(axis=0)[:, :, ["C1", "C3"]]

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C1 D0    9    8   11   10
         D1   13   12   15   14
      C3 D0   25   24   27   26
         D1   29   28   31   30
   B1 C1 D0   41   40   43   42
         D1   45   44   47   46
      C3 D0   57   56   59   58
         D1   61   60   63   62
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
      C3 D0   89   88   91   90
         D1   93   92   95   94
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
      C3 D0  121  120  123  122
         D1  125  124  127  126
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
      C3 D0  153  152  155  154
         D1  157  156  159  158
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174
      C3 D0  185  184  187  186
         D1  189  188  191  190
A3 B0 C1 D0  201  200  203  202
         D1  205  204  207  206
      C3 D0  217  216  219  218
         D1  221  220  223  222
   B1 C1 D0  233  232  235  234
         D1  237  236  239  238
      C3 D0  249  248  251  250
         D1  253  252  255  254

In [86]:
df2 = dfmi.copy()

df2.loc(axis=0)[:, :, ["C1", "C3"]] = -10

df2

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C0 D0    1    0    3    2
         D1    5    4    7    6
      C1 D0  -10  -10  -10  -10
         D1  -10  -10  -10  -10
      C2 D0   17   16   19   18
...          ...  ...  ...  ...
A3 B1 C1 D1  -10  -10  -10  -10
      C2 D0  241  240  243  242
         D1  245  244  247  246
      C3 D0  -10  -10  -10  -10
         D1  -10  -10  -10  -10

[64 rows x 4 columns]

In [87]:
df2 = dfmi.copy()

df2.loc[idx[:, :, ["C1", "C3"]], :] = df2 * 1000

df2

lvl0              a               b
lvl1            bar     foo     bah     foo
A0 B0 C0 D0       1       0       3       2
         D1       5       4       7       6
      C1 D0    9000    8000   11000   10000
         D1   13000   12000   15000   14000
      C2 D0      17      16      19      18
...             ...     ...     ...     ...
A3 B1 C1 D1  237000  236000  239000  238000
      C2 D0     241     240     243     242
         D1     245     244     247     246
      C3 D0  249000  248000  251000  250000
         D1  253000  252000  255000  254000

[64 rows x 4 columns]

In [88]:
df

                     A         B         C
first second
bar   one    -1.099968 -0.905454  2.980732
      two     0.775524  0.047056  0.567498
baz   one    -0.280117  0.474000  0.593460
      two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649
qux   one    -0.192781 -0.344664  0.127216
      two     0.716804  0.187324 -1.466834

In [89]:
df.xs("one", level="second")

              A         B         C
first
bar   -1.099968 -0.905454  2.980732
baz   -0.280117  0.474000  0.593460
foo    0.904136  0.177659  0.969994
qux   -0.192781 -0.344664  0.127216

In [90]:
# using the slicers

df.loc[(slice(None), "one"), :]

                     A         B         C
first second
bar   one    -1.099968 -0.905454  2.980732
baz   one    -0.280117  0.474000  0.593460
foo   one     0.904136  0.177659  0.969994
qux   one    -0.192781 -0.344664  0.127216

In [93]:
idx = pd.IndexSlice
df.loc[idx[:, "one"], :]

                     A         B         C
first second
bar   one    -1.099968 -0.905454  2.980732
baz   one    -0.280117  0.474000  0.593460
foo   one     0.904136  0.177659  0.969994
qux   one    -0.192781 -0.344664  0.127216

In [96]:
df

                     A         B         C
first second
bar   one    -1.099968 -0.905454  2.980732
      two     0.775524  0.047056  0.567498
baz   one    -0.280117  0.474000  0.593460
      two    -2.597763 -0.941213  0.452156
foo   one     0.904136  0.177659  0.969994
      two     0.079566  2.283450 -0.353649
qux   one    -0.192781 -0.344664  0.127216
      two     0.716804  0.187324 -1.466834

In [97]:
df = df.T
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [98]:
df.xs("one", level="second", axis=1)

first       bar       baz       foo       qux
A     -1.099968 -0.280117  0.904136 -0.192781
B     -0.905454  0.474000  0.177659 -0.344664
C      2.980732  0.593460  0.969994  0.127216

In [99]:
# using the slicers

df.loc[:, (slice(None), "one")]

first        bar       baz       foo       qux
second       one       one       one       one
A      -1.099968 -0.280117  0.904136 -0.192781
B      -0.905454  0.474000  0.177659 -0.344664
C       2.980732  0.593460  0.969994  0.127216

In [100]:
idx = pd.IndexSlice
df.loc[:, idx[:, "one"]]

first        bar       baz       foo       qux
second       one       one       one       one
A      -1.099968 -0.280117  0.904136 -0.192781
B      -0.905454  0.474000  0.177659 -0.344664
C       2.980732  0.593460  0.969994  0.127216

In [102]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -1.099968  0.775524 -0.280117 -2.597763  0.904136  0.079566 -0.192781
B      -0.905454  0.047056  0.474000 -0.941213  0.177659  2.283450 -0.344664
C       2.980732  0.567498  0.593460  0.452156  0.969994 -0.353649  0.127216

first
second       two
A       0.716804
B       0.187324
C      -1.466834

In [101]:
df.xs(("one", "bar"), level=("second", "first"), axis=1)

first        bar
second       one
A      -1.099968
B      -0.905454
C       2.980732

In [104]:
df.xs(("one", "bar"), level=("second", "first"), axis=1, drop_level=False)

first        bar
second       one
A      -1.099968
B      -0.905454
C       2.980732

In [103]:
# using the slicers

df.loc[:, ("bar", "one")]

A   -1.099968
B   -0.905454
C    2.980732
Name: (bar, one), dtype: float64

In [105]:
df.xs("one", level="second", axis=1, drop_level=False)

first        bar       baz       foo       qux
second       one       one       one       one
A      -1.099968 -0.280117  0.904136 -0.192781
B      -0.905454  0.474000  0.177659 -0.344664
C       2.980732  0.593460  0.969994  0.127216

In [106]:
df.xs("one", level="second", axis=1, drop_level=True)

first       bar       baz       foo       qux
A     -1.099968 -0.280117  0.904136 -0.192781
B     -0.905454  0.474000  0.177659 -0.344664
C      2.980732  0.593460  0.969994  0.127216

In [107]:
midx = pd.MultiIndex(

    levels=[["zero", "one"], ["x", "y"]], codes=[[1, 1, 0, 0], [1, 0, 1, 0]]

)



df = pd.DataFrame(np.random.randn(4, 2), index=midx)

df

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [109]:
df2 = df.groupby(level=0).mean()
df2

             0         1
one  -0.608563 -0.028131
zero -1.387342 -0.408518

In [110]:
df2.reindex(df.index, level=0)

               0         1
one  y -0.608563 -0.028131
     x -0.608563 -0.028131
zero y -1.387342 -0.408518
     x -1.387342 -0.408518

In [111]:
# aligning

df_aligned, df2_aligned = df.align(df2, level=0)

In [114]:
df

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [112]:
df_aligned

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [113]:
df2_aligned

               0         1
one  y -0.608563 -0.028131
     x -0.608563 -0.028131
zero y -1.387342 -0.408518
     x -1.387342 -0.408518

In [115]:
df[:5]

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [116]:
df[:5].swaplevel(0, 1, axis=0)

               0         1
y one   0.055253  0.264825
x one  -1.272378 -0.321088
y zero -2.222824 -0.139085
x zero -0.551860 -0.677951

In [117]:
df[:5].swaplevel(0, 1, axis=0).sort_index(level=0)

               0         1
x one  -1.272378 -0.321088
  zero -0.551860 -0.677951
y one   0.055253  0.264825
  zero -2.222824 -0.139085

In [118]:
df[:5].swaplevel(0, 1, axis=0).sort_index(level=[0, 1])

               0         1
x one  -1.272378 -0.321088
  zero -0.551860 -0.677951
y one   0.055253  0.264825
  zero -2.222824 -0.139085

In [120]:
df[:5].swaplevel(0, 1, axis=0).sort_index(level=[0, 1], ascending=[True, False])

               0         1
x zero -0.551860 -0.677951
  one  -1.272378 -0.321088
y zero -2.222824 -0.139085
  one   0.055253  0.264825

In [123]:
df[:5]

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [127]:
df[:5].reorder_levels([1, 0], axis=0)

               0         1
y one   0.055253  0.264825
x one  -1.272378 -0.321088
y zero -2.222824 -0.139085
x zero -0.551860 -0.677951

In [128]:
df[:5].swaplevel(0, 1, axis=0)

               0         1
y one   0.055253  0.264825
x one  -1.272378 -0.321088
y zero -2.222824 -0.139085
x zero -0.551860 -0.677951

In [129]:
df.rename(columns={0: "col0", 1: "col1"})

            col0      col1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [130]:
df.rename(index={"one": "two", "y": "z"})

               0         1
two  z  0.055253  0.264825
     x -1.272378 -0.321088
zero z -2.222824 -0.139085
     x -0.551860 -0.677951

In [131]:
df.rename_axis(index=["abc", "def"])

                 0         1
abc  def
one  y    0.055253  0.264825
     x   -1.272378 -0.321088
zero y   -2.222824 -0.139085
     x   -0.551860 -0.677951

In [133]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [134]:
df.rename_axis(columns="Cols").columns

RangeIndex(start=0, stop=2, step=1, name='Cols')

In [135]:
mi = pd.MultiIndex.from_product([[1, 2], ["a", "b"]], names=["x", "y"])

mi.names

FrozenList(['x', 'y'])

In [136]:
mi2 = mi.rename("new name", level=0)

mi2

MultiIndex([(1, 'a'),
            (1, 'b'),
            (2, 'a'),
            (2, 'b')],
           names=['new name', 'y'])

In [143]:
tuples

[('qux', 'one'),
 ('foo', 'two'),
 ('baz', 'one'),
 ('bar', 'two'),
 ('baz', 'two'),
 ('qux', 'two'),
 ('bar', 'one'),
 ('foo', 'one')]

In [145]:
import random

random.shuffle(tuples)

tuples

[('foo', 'one'),
 ('qux', 'one'),
 ('qux', 'two'),
 ('bar', 'two'),
 ('baz', 'two'),
 ('bar', 'one'),
 ('foo', 'two'),
 ('baz', 'one')]

In [140]:
s = pd.Series(np.random.randn(8), index=pd.MultiIndex.from_tuples(tuples))

s

qux  one    0.871198
foo  two   -0.920483
baz  one    0.785675
bar  two    1.473738
baz  two   -1.001435
qux  two    0.190501
bar  one   -1.414677
foo  one    0.572881
dtype: float64

In [146]:
s.sort_index()

bar  one   -1.414677
     two    1.473738
baz  one    0.785675
     two   -1.001435
foo  one    0.572881
     two   -0.920483
qux  one    0.871198
     two    0.190501
dtype: float64

In [147]:
s

qux  one    0.871198
foo  two   -0.920483
baz  one    0.785675
bar  two    1.473738
baz  two   -1.001435
qux  two    0.190501
bar  one   -1.414677
foo  one    0.572881
dtype: float64

In [148]:
s.sort_index(level=0)

bar  one   -1.414677
     two    1.473738
baz  one    0.785675
     two   -1.001435
foo  one    0.572881
     two   -0.920483
qux  one    0.871198
     two    0.190501
dtype: float64

In [149]:
s.sort_index(level=0, sort_remaining=False)

bar  two    1.473738
     one   -1.414677
baz  one    0.785675
     two   -1.001435
foo  two   -0.920483
     one    0.572881
qux  one    0.871198
     two    0.190501
dtype: float64

In [150]:
s.sort_index(level=1)

bar  one   -1.414677
baz  one    0.785675
foo  one    0.572881
qux  one    0.871198
bar  two    1.473738
baz  two   -1.001435
foo  two   -0.920483
qux  two    0.190501
dtype: float64

In [151]:
s.sort_index(level=1, sort_remaining=False)

qux  one    0.871198
baz  one    0.785675
bar  one   -1.414677
foo  one    0.572881
     two   -0.920483
bar  two    1.473738
baz  two   -1.001435
qux  two    0.190501
dtype: float64

In [152]:
s.index = s.index.set_names(["L1", "L2"])

In [153]:
s

L1   L2
qux  one    0.871198
foo  two   -0.920483
baz  one    0.785675
bar  two    1.473738
baz  two   -1.001435
qux  two    0.190501
bar  one   -1.414677
foo  one    0.572881
dtype: float64

In [154]:
s.sort_index(level="L1")

L1   L2
bar  one   -1.414677
     two    1.473738
baz  one    0.785675
     two   -1.001435
foo  one    0.572881
     two   -0.920483
qux  one    0.871198
     two    0.190501
dtype: float64

In [155]:
s.sort_index(level="L2")

L1   L2
bar  one   -1.414677
baz  one    0.785675
foo  one    0.572881
qux  one    0.871198
bar  two    1.473738
baz  two   -1.001435
foo  two   -0.920483
qux  two    0.190501
dtype: float64

In [156]:
df

               0         1
one  y  0.055253  0.264825
     x -1.272378 -0.321088
zero y -2.222824 -0.139085
     x -0.551860 -0.677951

In [157]:
df.T

        one                zero
          y         x         y         x
0  0.055253 -1.272378 -2.222824 -0.551860
1  0.264825 -0.321088 -0.139085 -0.677951

In [158]:
df.T.sort_index(level=1, axis=1)

        one      zero       one      zero
          x         x         y         y
0 -1.272378 -0.551860  0.055253 -2.222824
1 -0.321088 -0.677951  0.264825 -0.139085

In [159]:
dfm = pd.DataFrame(

    {"jim": [0, 0, 1, 1], "joe": ["x", "x", "z", "y"], "jolie": np.random.rand(4)}

)



dfm = dfm.set_index(["jim", "joe"])

dfm

            jolie
jim joe
0   x    0.895482
    x    0.042068
1   z    0.925537
    y    0.702337

In [160]:
dfm.loc[(1, 'z')]

C:\Users\YOSSI\AppData\Local\Temp\ipykernel_20876\1188037207.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  dfm.loc[(1, 'z')]

            jolie
jim joe
1   z    0.925537

In [161]:
dfm.index.is_monotonic_increasing

False

In [162]:
dfm = dfm.sort_index()

dfm

            jolie
jim joe
0   x    0.895482
    x    0.042068
1   y    0.702337
    z    0.925537

In [163]:
dfm.index.is_monotonic_increasing

True

In [164]:
dfm.loc[(1, 'z')]

            jolie
jim joe
1   z    0.925537

In [165]:
dfm.loc[(0, "y"):(1, "z")]

            jolie
jim joe
1   y    0.702337
    z    0.925537

In [166]:
index = pd.Index(np.random.randint(0, 1000, 10))

index

Index([450, 317, 20, 317, 119, 289, 996, 925, 741, 218], dtype='int32')

In [167]:
positions = [0, 9, 3]

In [168]:
index[positions]

Index([450, 218, 317], dtype='int32')

In [169]:
index.take(positions)

Index([450, 218, 317], dtype='int32')

In [172]:
ser = pd.Series(np.random.randn(10))

ser

0   -0.630655
1   -0.138161
2    0.122236
3    0.995529
4   -0.566748
5    1.221799
6   -0.752745
7   -1.106251
8   -0.243608
9   -0.285630
dtype: float64

In [173]:
ser.iloc[positions]

0   -0.630655
9   -0.285630
3    0.995529
dtype: float64

In [174]:
ser.take(positions)

0   -0.630655
9   -0.285630
3    0.995529
dtype: float64

In [175]:
frm = pd.DataFrame(np.random.randn(5, 3))
frm

          0         1         2
0  1.809678  0.882235 -0.292972
1  1.508309  0.452073 -1.361920
2  1.096107 -0.642763 -0.626200
3 -0.603139  0.577286 -2.051688
4 -0.385508  0.514070  0.660770

In [176]:
frm.take([1, 4, 3])

          0         1         2
1  1.508309  0.452073 -1.361920
4 -0.385508  0.514070  0.660770
3 -0.603139  0.577286 -2.051688

In [177]:
frm.take([0, 2], axis=1)

          0         2
0  1.809678 -0.292972
1  1.508309 -1.361920
2  1.096107 -0.626200
3 -0.603139 -2.051688
4 -0.385508  0.660770

In [178]:
arr = np.random.randn(10)
arr

array([-0.3309192 ,  0.29238895, -1.21890091, -0.17307391,  0.28057069,
       -0.08252068, -1.88823236,  0.46156792, -0.82635175,  0.79629093])

In [179]:
arr.take([False, False, True, True])

array([-0.3309192 , -0.3309192 ,  0.29238895,  0.29238895])

In [180]:
arr[[0, 1]]

array([-0.3309192 ,  0.29238895])

In [183]:
ser

0   -0.630655
1   -0.138161
2    0.122236
3    0.995529
4   -0.566748
5    1.221799
6   -0.752745
7   -1.106251
8   -0.243608
9   -0.285630
dtype: float64

In [181]:
ser.take([False, False, True, True])

0   -0.630655
0   -0.630655
1   -0.138161
1   -0.138161
dtype: float64

In [182]:
ser.iloc[[0, 1]]

0   -0.630655
1   -0.138161
dtype: float64

In [184]:
arr = np.random.randn(10000, 5)

indexer = np.arange(10000)

random.shuffle(indexer)

%timeit arr[indexer]

%timeit arr.take(indexer, axis=0)

118 s  9.11 s per loop (mean  std. dev. of 7 runs, 10,000 loops each)
43.1 s  2.49 s per loop (mean  std. dev. of 7 runs, 10,000 loops each)

In [185]:
ser = pd.Series(arr[:, 0])

%timeit ser.iloc[indexer]

%timeit ser.take(indexer)

107 s  8.78 s per loop (mean  std. dev. of 7 runs, 10,000 loops each)
111 s  16.6 s per loop (mean  std. dev. of 7 runs, 10,000 loops each)

In [186]:
from pandas.api.types import CategoricalDtype

df = pd.DataFrame({"A": np.arange(6), "B": list("aabbca")})
df

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  c
5  5  a

In [187]:
df["B"] = df["B"].astype(CategoricalDtype(list("cab")))

df

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  c
5  5  a

In [188]:
df.dtypes

A       int32
B    category
dtype: object

In [189]:
df["B"].cat.categories

Index(['c', 'a', 'b'], dtype='object')

In [190]:
df2 = df.set_index("B")

df2.index

CategoricalIndex(['a', 'a', 'b', 'b', 'c', 'a'], categories=['c', 'a', 'b'], ordered=False, dtype='category', name='B')

In [192]:
df2

   A
B
a  0
a  1
b  2
b  3
c  4
a  5

In [191]:
df2.loc["a"]

   A
B
a  0
a  1
a  5

In [193]:
df2.loc["a"].index

CategoricalIndex(['a', 'a', 'a'], categories=['c', 'a', 'b'], ordered=False, dtype='category', name='B')

In [194]:
df2.sort_index()

   A
B
c  4
a  0
a  1
a  5
b  2
b  3

In [197]:
df2.groupby(level=0, observed=True).sum()

   A
B
c  4
a  6
b  5

In [198]:
df2.groupby(level=0, observed=True).sum().index

CategoricalIndex(['c', 'a', 'b'], categories=['c', 'a', 'b'], ordered=False, dtype='category', name='B')

In [199]:
df3 = pd.DataFrame(

    {"A": np.arange(3), "B": pd.Series(list("abc")).astype("category")}

)
df3

   A  B
0  0  a
1  1  b
2  2  c

In [200]:
df3 = df3.set_index("B")

df3

   A
B
a  0
b  1
c  2

In [201]:
df3.reindex(["a", "e"])

     A
B
a  0.0
e  NaN

In [202]:
df3.reindex(["a", "e"]).index

Index(['a', 'e'], dtype='object', name='B')

In [203]:
df3.reindex(pd.Categorical(["a", "e"], categories=list("abe")))

     A
B
a  0.0
e  NaN

In [204]:
df3.reindex(pd.Categorical(["a", "e"], categories=list("abe"))).index

CategoricalIndex(['a', 'e'], categories=['a', 'b', 'e'], ordered=False, dtype='category', name='B')